InformationRegisters/ЗапросыОблачныхПриложений/ЗапросыОблачныхПриложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыОблачныхПриложений</name>
  <resources>
    <name>УдалитьПриложение</name>
    <type>
      <types>CatalogRef.ОблачныеПриложения</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Запрос</name>
    <comment>Данные запроса строкой JSON</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HTTPServices/ExternalAPI/Module.bsl
#Область ОбработчикиСобытий

Функция ПоказателиМонитораРуководителяПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеМонитора();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
	
КонецФункции

Функция ПоказателиМонитораРуководителяДатаОбновленияПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДатыОбновленияМонитора();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
	
КонецФункции

Функция ПоказателиМонитораРуководителяОбновитьЗапустить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	Результат = МониторРуководителя.ЗапуститьОбновлениеМонитораДляВнешнегоПрограммногоИнтерфейса();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат = Неопределено Тогда
		// Фоновое задание запущено ранее и все еще выполняется.
		Ответ = Новый HTTPСервисОтвет(202);
	Иначе
		// Фоновое задание запущено.
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция АктуальныеЗадачиПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеНалоговыеСобытияКалендаряБухгалтера();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
	
КонецФункции

Функция АктуальныеЗадачиДатаОбновленияПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДатыАктуальностиНалоговыхСобытийКалендаряБухгалтера();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
	
КонецФункции

Функция АктуальныеЗадачиСтатусУстановить(Запрос)
	
	ПараметрыМетода = Новый Структура("Идентификатор, Выполнено");
	
	ПараметрыИзЗапроса = ОбщегоНазначенияБП.СтруктураИзСтрокиJSON(Запрос.ПолучитьТелоКакСтроку());
	
	ПараметрыМетода.Идентификатор = ПараметрыИзЗапроса.id;
	ПараметрыМетода.Выполнено = ПараметрыИзЗапроса.done;
	Для Каждого ПараметрМетода Из ПараметрыМетода Цикл
		Если Не ЗначениеЗаполнено(ПараметрМетода.Значение) Тогда
			Ответ = Новый HTTPСервисОтвет(400, НСтр("ru = 'Переданы некорректные параметры'"));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		ВнешнийПрограммныйИнтерфейс.УстановитьСтатусЗадачи(ПараметрыМетода);
		УстановитьПривилегированныйРежим(Ложь);
		
		// Успешно изменили статус задачи.
		Ответ = Новый HTTPСервисОтвет(200);
		
	Исключение
		
		// Не удалось изменить статус задачи.
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось изменить статус задачи %1 по причине:
				|%2'"),
			ПараметрыМетода.Идентификатор, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации("ExternalAPI",
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
		Ответ = Новый HTTPСервисОтвет(400, ТекстОшибки);
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция БанковскиеСчетаПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеБанковскихСчетов();
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
	
КонецФункции

Функция СообщенияРегламентированнойОтчетностиПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отсутствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеСообщенияРегламентированнойОтчетности();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
	
КонецФункции

Функция ПодключенияПриложенийОблакаСоздатьПодключение(Запрос)
	
	ТекстЗапроса = "";
	Попытка
		
		ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
		РезультатОбработки = СоздатьПодключениеПриложенияОблака(ТекстЗапроса);
		
		Возврат РезультатОбработки;
		
	Исключение
		
		ЗаписатьИсключениеHTTPСервиса(
			ИнформацияОбОшибке(),
			Метаданные.HTTPСервисы.ExternalAPI.ШаблоныURL.ПодключенияПриложенийОблака.Методы.СоздатьПодключение,
			ТекстЗапроса);
		
		ВызватьИсключение;
	КонецПопытки;
КонецФункции

Функция ПодключенияПриложенийОблакаПроверитьПодключение(Запрос)
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния());
	
КонецФункции

Функция СообщенияОблачныхПриложенийЗапросить(Запрос)
	
	ТекстЗапроса = "";
	Попытка
		
		ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
		Возврат ЗапроситьДанныеПриложения(ТекстЗапроса, Запрос.Заголовки);
		
	Исключение
		
		ЗаписатьИсключениеHTTPСервиса(
			ИнформацияОбОшибке(),
			Метаданные.HTTPСервисы.ExternalAPI.ШаблоныURL.ОтчетныеКампанииЗапросы.Методы.Запросить,
			ТекстЗапроса);
		
		ВызватьИсключение;
		
	КонецПопытки;

КонецФункции

Функция СообщенияОблачныхПриложенийПолучить(Запрос)
	
	Попытка
		
		ИдентификаторЗапроса = Запрос.ПараметрыURL["RequestId"];
		Если Не ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
			Возврат Ответ(ЗапросыREST.КодСостоянияПлохойЗапрос(), Ошибка(Нстр("ru = 'Не указан идентификатор запроса'")));
		КонецЕсли;
		
		Возврат ПолучитьДанныеПриложения(ИдентификаторЗапроса, Запрос.Заголовки);
	Исключение
		
		ЗаписатьИсключениеHTTPСервиса(
			ИнформацияОбОшибке(),
			Метаданные.HTTPСервисы.ExternalAPI.ШаблоныURL.ОтчетныеКампанииЗапросы.Методы.Получить);
		
		ВызватьИсключение;
		
	КонецПопытки;

КонецФункции

Функция СообщенияОблачныхПриложенийПодтвердитьПолучение(Запрос)
	
	Попытка
		
		ИдентификаторЗапроса = Запрос.ПараметрыURL["RequestId"];
		Если Не ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
			Возврат Ответ(ЗапросыREST.КодСостоянияНеАутентифицирован(), Ошибка(Нстр("ru = 'Не указан идентификатор запроса'")));
		КонецЕсли;
		
		Возврат ПодтвердитьПолучениеДанныхПриложения(ИдентификаторЗапроса, Запрос.Заголовки);
		
	Исключение
		
		ЗаписатьИсключениеHTTPСервиса(
			ИнформацияОбОшибке(),
			Метаданные.HTTPСервисы.ExternalAPI.ШаблоныURL.ОтчетныеКампанииЗапросы.Методы.ПодтвердитьПолучение);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецФункции

Функция ТарифСтраховыхВзносовИППолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеТарифаСтраховыхВзносовИП();
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
КонецФункции

Функция СтавкиУСНПолучить(Запрос)
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеСтавокУСН();
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ПубликуемыеДанные);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СообщенияОблачныхПриложений

Функция СоздатьПодключениеПриложенияОблака(ТекстЗапроса)
	
	ДанныеПодключения = НовыйДанныеПодключенияПриложения();
	ДанныеПодключения.ИдентификаторПриложения = СообщенияОблачныхПриложений.ИдентификаторЭтогоПриложения();
	ДанныеПодключения.ДоступныеОрганизации = СообщенияОтчетностиОблачныхПриложений.ДоступныеОрганизацииПользователя();
		
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ДанныеПодключения);
	
КонецФункции

Функция ЗапроситьДанныеПриложения(ТекстЗапроса, Заголовки)
	
	ТребуемыеПоля = Новый Массив;
	ТребуемыеПоля.Добавить("ТипЗапроса");
	
	ДанныеЗапроса = ДанныеЗапроса(ТекстЗапроса, ТребуемыеПоля);
	Если ТипЗнч(ДанныеЗапроса) = Тип("Строка") Тогда
		Возврат Ответ(ЗапросыREST.КодСостоянияПлохойЗапрос(), ДанныеЗапроса);
	КонецЕсли;
	
	// В общем случае запрос должен быть обработан асинхронно. Но есть ситуации, когда запрос не требует длительного времени
	// для обработки и может быть обработан сразу же (например, получение списка организаций приложения).
	Если ДанныеЗапроса.Свойство("ВыполнитьСинхронно") И ДанныеЗапроса.ВыполнитьСинхронно Тогда
		ДанныеОтвета = СообщенияОтчетностиОблачныхПриложений.ОтветНаЗапросОблачногоПриложения(ТекстЗапроса);
		Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ДанныеОтвета);
	КонецЕсли;
	
	НовыйЗапрос = РегистрыСведений.ЗапросыОблачныхПриложений.Создать(ДанныеЗапроса);
		
	Если НовыйЗапрос = Неопределено Тогда
		Возврат Ответ(ЗапросыREST.КодСостоянияВнутренняяОшибкаСервера(), Ошибка(Нстр("ru = 'Новый запрос не может быть создан.'")));
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура("Идентификатор", НовыйЗапрос);
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), ДанныеОтвета);
	
КонецФункции

Функция ПолучитьДанныеПриложения(ИдентификаторЗапроса, Заголовки)
	
	Данные = РегистрыСведений.ЗапросыОблачныхПриложений.ПрочитатьОтвет(
		Новый УникальныйИдентификатор(ИдентификаторЗапроса));
		
	Если Данные = Неопределено Тогда
		Возврат Ответ(ЗапросыREST.КодСостоянияНетДанных());
	ИначеЕсли Данные = "" Тогда
		Возврат Ответ(ЗапросыREST.КодСостоянияОтсутствуетСодержимое());
	КонецЕсли;
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния(), Данные);
КонецФункции

Функция ПодтвердитьПолучениеДанныхПриложения(ИдентификаторЗапроса, Заголовки)
	
	РегистрыСведений.ЗапросыОблачныхПриложений.ОтметитьПрочитано(
		Новый УникальныйИдентификатор(ИдентификаторЗапроса));
	
	Возврат Ответ(ЗапросыREST.КодСтандартногоСостояния());
	
КонецФункции

#КонецОбласти

Функция Ответ(КодОтвета, Данные = "")
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.Заголовки["Cache-Control"] = "no-cache";
	
	Ответ.УстановитьТелоИзСтроки(ДанныеJSON(Данные));
	
	Возврат Ответ;
	
КонецФункции

Функция ДанныеJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ");
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция Ошибка(ТекстОшибки)
	
	Возврат Новый Структура("Ошибка", ТекстОшибки);
	
КонецФункции

Функция НовыйДанныеПодключенияПриложения()
	
	ДанныеПодключения = Новый Структура;
	ДанныеПодключения.Вставить("ИдентификаторПриложения", "");
	ДанныеПодключения.Вставить("ДоступныеОрганизации", Новый Массив);
	
	Возврат ДанныеПодключения;
	
КонецФункции

Функция ДанныеЗапроса(ТекстЗапроса, ТребуемыеПоля = Неопределено, СвойстваТипаДата = Неопределено)
	
	Если ТипЗнч(ТекстЗапроса) <> Тип("Строка") Или Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат Нстр("ru = 'Отсутствует текст запроса'");
	КонецЕсли;
	
	Попытка
		Запрос = ОбщегоНазначенияБП.СтруктураИзСтрокиJSON(ТекстЗапроса, СвойстваТипаДата);
	Исключение
		Возврат Нстр("ru = 'Объект JSON описан неверно'");
	КонецПопытки;

	Если ТребуемыеПоля <> Неопределено Тогда
		ОтсутствующиеПоля = "";
		Для Каждого Поле Из ТребуемыеПоля Цикл
			Если Не Запрос.Свойство(Поле) Тогда
				ОтсутствующиеПоля = ?(ЗначениеЗаполнено(ОтсутствующиеПоля),
					СтрШаблон("%1, %2", ОтсутствующиеПоля, Поле),
					Поле);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОтсутствующиеПоля) Тогда
			Возврат СтрШаблон(Нстр("ru = 'Отсутствуют обязательные поля: %1'"), ОтсутствующиеПоля);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос;
КонецФункции

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат "ExternalAPI";
	
КонецФункции

Процедура ЗаписатьИсключениеHTTPСервиса(ИнформацияОбОшибке, Метод, ТекстЗапроса = "")
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метод,
		ТекстЗапроса,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
КонецПроцедуры

#КонецОбласти
